N = int(input())                                                                # N 입력

for i in range(N-1):                                                            # 사각형 윗부분 출력
    print("* " * i + "*" * (1 + 4 * (N - i - 1)) + " *" * i)
    print("* " * (i + 1) + " " * (1 + 4 * (N - i - 2)) + " *" * (i + 1))

print("* " * (2 * N - 1))                                                       # 사각형 가운데 부분 출력


for j in range(N-1):                                                            # 사각형 아랫부분 출력
    print("* " * (N - j - 1) + " " * (1 + 4 * j) + " *" * (N - j - 1))
    print("* " * (N - j - 2) + "*" * (1 + 4 * (j + 1)) + " *" * (N - j - 2))